{
	"awards":[
		{
			"name": "Allen's Playhouse",
			"link": "https://www.allensplayhouse.com/",
			"linkyt": "https://www.youtube.com/channel/UChY7g9ETj3fVVQiLizmexoQ/",
			"desc-shrt": "Children's interest, esp. book read-a-louds",
			"desc-long": "I discovered Allen's Playhouse while looking for a read-a-loud video for my son who loves the 'Little Blue Truck' series of books. APH has a number of recent videos with a father and son enjoying trips out-of-doors or narrating an adventure through a book or place.",
			"last-checked": "APR11/2020"
		},{
			"name": "BirdOPrey5",
			"link": "https://www.birdoprey5.com/",
			"linkyt": "https://www.youtube.com/user/birdoprey5/",
			"desc-shrt": "TV analysis, esp Star Trek",
			"desc-long": "I am interested in sci-fi, esp. series that try to guide and encourage the modern viewer to... uh... ...'progressive'... morality. (author: Sorry, verbiage is key here and certain words scare off people... um... socially-conscious? responsible? golden rule? Regardless, Gene Roddenberry says, and I'm quoting Wikipedia here, 'Understand that Star Trek is more than just my political philosophy, my racial philosophy, my overview on life and the human condition.' With that in mind, we wonder how life may imitate art.)",
			"last-checked": "APR11/2020"
		},{
			"name": "Cuck Philosophy",
			"link": "https://twitter.com/PhilosophyCuck",
			"linkyt": "https://www.youtube.com/channel/UCSkzHxIcfoEr69MWBdo0ppg/",
			"desc-shrt": "Philosophy and idea-critique",
			"desc-long": "I believe this discovery was found while searching to expand my knowledge about historical writers. I like his channel and point of view and that he doesn't (too often) condescend to the viewer.",
			"last-checked": "APR11/2020"
		},{
			"name": "Ferris Wheelhouse",
			"link": "https://www.looneycritic.com/",
			"linkyt": "https://www.youtube.com/channel/UCJWfgwlqSZg9crd1gXE7HSA/",
			"desc-shrt": "Looney Tunes analysis",
			"desc-long": "He has a huge collection of Looney Tunes and shares them with his own commentary and anecdotes. Lots of old ones I hadn't seen before. You'll probably learn more history here than in a textbook.",
			"last-checked": "APR11/2020"
		},{
			"name": "Hopscotch",
			"link": "https://www.hopscotchsongs.com/",
			"linkyt": "https://www.youtube.com/channel/UCgM7EYFFz_dba0OIZs5L9kg/",
			"desc-shrt": "Children's interest, esp. teaching songs",
			"desc-long": "Hopscotch is a great kid's channel. They have simple songs with simple ideas and don't get bogged down in the details. Some of my favorites are the planets, habitats, and continents. The counting songs may help your little one establish a link between counting numbers and keeping rhythm.",
			"last-checked": "APR11/2020"
		},{
			"name": "Magma",
			"link": "",
			"linkyt": "https://www.youtube.com/channel/UCyGteX4xK-ZO7u9GMB8gKfA/",
			"desc-shrt": "Minecraft",
			"desc-long": "Magma creates simple videos that either explore his builds or teach the viewer something new about the world of Minecraft. His videos are subtitled rather than spoken-aloud, and this creates a tight verse that seems to go well with the quantified world of Minecraft. His approach is calming and, dare-I-say, _kind_ to the viewer, so I can even watch this one with the kids.",
			"last-checked": "APR11/2020"
		},{
			"name": "Nyhm",
			"link": "",
			"linkyt": "https://www.youtube.com/channel/UCNttVtX1_K2kSwKcCgK_Acw/",
			"desc-shrt": "World of Warcraft music videos",
			"desc-long": "Sorry I couldn't make a list of YT content creators without including this guy. I know some of these songs better than I know the originals. I have to include him as a love-letter to the power of user-created content and the importance of shared experience.",
			"last-checked": "APR11/2020"
		},{
			"name": "Preach",
			"link": "https://twitter.com/PreachGaming",
			"linkyt": "https://www.youtube.com/channel/UCXJL3ST-O0J3nqzQyPJtpNg/",
			"desc-shrt": "World of Warcraft analysis",
			"desc-long": "There are a lot of WoW streamers that I'm at least vaguely familiar with, but only Preach is making the list here. Many big names have big love for the game, but some reason or another, may not speak as well to my generation or RL-needs as the context for the game. I tend to agree with Preach more often than not, and that is saying something.",
			"last-checked": "APR11/2020"
		},{
			"name": "Scratch Garden",
			"link": "https://scratchgarden.com/",
			"linkyt": "https://www.youtube.com/channel/UC8NFs-VWUsyuq4zaYVVMgCQ/",
			"desc-shrt": "Children's interest, esp. teaching songs",
			"desc-long": "A lot of Scratch Garden songs have entered the common parlance in my house. They have a good head for music and make tunes that even YOU might like. Their animation style is clear and consistent.",
			"last-checked": "APR11/2020"
		},{
			"name": "Spiffworld",
			"link": "http://www.spiffworld.com/",
			"linkyt": "https://www.youtube.com/channel/UC4l9kQgaY5wmuW2Lpy-E31Q/",
			"desc-shrt": "World of Warcraft / JoCo music videos",
			"desc-long": "Another entry of historical significance for me, Spiffworld created some of the most enduring pieces of emotional gravitas that I can cite from the early days of YT's growth. Every so often these songs worm their way into my brain and only these videos will scratch the itch.",
			"last-checked": "APR11/2020"
		}
	
	]
}
